In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('weekly_MSFT.csv')

In [3]:
df.head()

    timestamp    open    high     low   close     volume
0  2019-05-24  126.52  128.24  124.74  126.24   92097439
1  2019-05-17  124.11  130.46  123.04  128.07  139816701
2  2019-05-10  126.39  128.56  123.57  127.13  146827040
3  2019-05-03  129.90  130.70  125.52  128.90  119573665
4  2019-04-26  122.62  131.37  122.57  129.89  132620050

In [4]:
df['timestamp'] = df['timestamp'].apply(pd.to_datetime)

In [5]:
df.head()

   timestamp    open    high     low   close     volume
0 2019-05-24  126.52  128.24  124.74  126.24   92097439
1 2019-05-17  124.11  130.46  123.04  128.07  139816701
2 2019-05-10  126.39  128.56  123.57  127.13  146827040
3 2019-05-03  129.90  130.70  125.52  128.90  119573665
4 2019-04-26  122.62  131.37  122.57  129.89  132620050

In [6]:
df2 = df[['timestamp', 'close']]

In [7]:
df2.head()

   timestamp   close
0 2019-05-24  126.24
1 2019-05-17  128.07
2 2019-05-10  127.13
3 2019-05-03  128.90
4 2019-04-26  129.89

In [ ]:
df.set_index('datetime', inplace=True)